---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasMarkersAndTextSettings
source: html/b46418f4-b80f-9910-3c9f-53bf5adc8c13.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasMarkersAndTextSettings Method

If true style has markers and text settings.

## Syntax (C#)
```csharp
public bool HasMarkersAndTextSettings()
```